marcelkottmann/esp32-javascript/components/socket-events/socket-events.c
    return 0;
}

static duk_ret_t el_createNonBlockingSocket(duk_context *ctx)
{
    int sockfd = createNonBlockingSocket(AF_INET, SOCK_STREAM, IPPROTO_TCP, true);

    duk_push_int(ctx, sockfd);
    return 1;
}

static duk_ret_t el_connectNonBlocking(duk_context *ctx)
{
    int sockfd = duk_to_int(ctx, 0);
    const char *hostname = duk_to_string(ctx, 1);
    int port = duk_to_int(ctx, 2);

    int ret = connectNonBlocking(sockfd, hostname, port);
    duk_push_int(ctx, ret);
    return 1;
}

static duk_ret_t el_bindAndListen(duk_context *ctx)
{
    int sockfd = duk_to_int(ctx, 0);
    int port = duk_to_int(ctx, 1);

    int ret = bindAndListen(sockfd, port);
    duk_push_int(ctx, ret);
    return 1;
}

static duk_ret_t el_acceptIncoming(duk_context *ctx)
{
    int sockfd = duk_to_int(ctx, 0);

    int ret = acceptIncoming(sockfd);
    if (ret < 0)
    {
        if (errno == EAGAIN)
        {
            jslog(INFO, "accept returned EAGAIN\n");
            //return undefined
            return 0;
        }
        else
        {
            jslog(ERROR, "accept returned errno:%d on socket %d\n", errno, sockfd);
        }
    }

    duk_push_int(ctx, ret);
    return 1;
}

static duk_ret_t shutdownSSL(duk_context *ctx)
{
    SSL *ssl = (SSL *)duk_to_int(ctx, 0);
    SSL_shutdown(ssl);
    return 0;
}

static duk_ret_t freeSSL(duk_context *ctx)
{
    SSL *ssl = (SSL *)duk_to_int(ctx, 0);
    SSL_free(ssl);
    return 0;
}

static duk_ret_t acceptSSL(duk_context *ctx)
{
    SSL *ssl = (SSL *)duk_to_int(ctx, 0);
    int sockfd = duk_to_int(ctx, 1);
    jslog(INFO, "SSL server accept client ......");
    SSL_set_fd(ssl, sockfd);
    jslog(INFO, "SSL_accept ......");
    errno = 0;
    int ret = SSL_accept(ssl);
    if (ret <= 0)
    {
        jslog(INFO, "SSL_accept failed; return value %d and error %d and errno %d", ret, SSL_get_error(ssl, ret), errno);
    }
    else
    {
        jslog(INFO, "OK");
    }
    duk_push_int(ctx, ret);
    return 1;
}

static duk_ret_t connectSSL(duk_context *ctx)
{
    int before = errno;
    SSL *ssl = (SSL *)duk_to_int(ctx, 0);
    int sockfd = duk_to_int(ctx, 1);
    jslog(INFO, "SSL server connect server ......");
    if (SSL_get_fd(ssl) < 0)
    {
        SSL_set_fd(ssl, sockfd);
    }
    struct ssl_pm *ssl_pm = ssl->ssl_pm;
    esp_crt_bundle_attach(&(ssl_pm->conf));

    int ret = SSL_connect(ssl);
    int error = 1; // means "no error"
    if (ret <= 0)
    {
        int err = SSL_get_error(ssl, ret);
        jslog(ERROR, "SSL_connect failed, return value was %d; SOCKET %d SSL error code %d and errno %d and before errno was %d", ret, sockfd, err, errno, before);

        if (err == 5 && errno == 11) //EAGAIN
        {
            error = 0; //retry
        }
        else
        {
            error = -1; //means "error"
        }
    }

    if (error < 0)
    {
        SSL_shutdown(ssl);
    }

    duk_push_int(ctx, error);
    return 1;
}

static duk_ret_t el_closeSocket(duk_context *ctx)
{
    int socketfd = duk_to_int(ctx, 0);
    closeSocket(socketfd);
    return 0;
}

static duk_ret_t writeSocket_bind(duk_context *ctx)
{
    int sockfd = duk_to_int(ctx, 0);
    const char *msg = NULL;
    int len = 0;
    int offset = 0;
    SSL *ssl = NULL;

    if (!duk_is_undefined(ctx, 3))
    {
        offset = duk_to_int(ctx, 3);
    }
    if (!duk_is_undefined(ctx, 4))
    {
        ssl = (SSL *)duk_to_int(ctx, 4);
    }

    if (duk_is_string(ctx, 1))
    {
        msg = duk_to_string(ctx, 1);
        if (duk_is_undefined(ctx, 2))
        {
            len = strlen(msg) - offset;
        }
        else
        {
            len = duk_to_int(ctx, 2);
        }
    }
    else
    {
        duk_size_t buffer_len;
        msg = (char *)duk_get_buffer_data(ctx, 1, &buffer_len);

        if (duk_is_undefined(ctx, 2))
        {
            len = buffer_len - offset;
        }
        else
        {
            len = duk_to_int(ctx, 2);

            if (len + offset > buffer_len)
            {
                return -1;
            }
        }
    }
    int ret = writeSocket(sockfd, msg + offset, len, ssl);

    duk_push_int(ctx, ret);
    return 1;
}

static duk_ret_t el_getsockopt(duk_context *ctx)
{
    int sockfd = duk_to_int(ctx, 0);
    int val;
    unsigned int len = sizeof(int);
    if (getsockopt(sockfd, SOL_SOCKET, SO_ERROR, &val, &len) < 0)
    {
        return -1;
    }
    duk_push_int(ctx, val);
    return 1;
}

static duk_ret_t el_readSocket(duk_context *ctx)
{
    int sockfd = duk_to_int(ctx, 0);

    SSL *ssl = NULL;
    if (!duk_is_undefined(ctx, 1))
    {
        ssl = (SSL *)duk_to_int(ctx, 1);
    }

    int LEN = 3 * 1024;
    char msg[LEN];

    int ret = 0;
    int error = 0;

    if (ssl == NULL)
    {
        ret = readSocket(sockfd, msg, LEN - 1);
        error = errno;
    }
    else
    {
        ret = SSL_read(ssl, msg, LEN - 1);
        if (ret < 0)
        {
            error = SSL_get_error(ssl, ret);
        }
    }

    if (ret >= 0)
    {
        msg[ret] = '\0';
        duk_idx_t obj_idx = duk_push_object(ctx);
        duk_push_int(ctx, ret);
        duk_put_prop_string(ctx, obj_idx, "length");
        duk_push_string(ctx, msg);
        duk_put_prop_string(ctx, obj_idx, "data");
    }
    else if ((ssl == NULL && error == EAGAIN) || (ssl != NULL && error == SSL_ERROR_WANT_READ))
    {
        jslog(DEBUG, "*** EAGAIN OR SSL_ERROR_WANT_READ RETURNED!!!\n");

        //eagain
        duk_push_undefined(ctx);
    }
    else
    {
        jslog(ERROR, "READ ERROR return value %d and error code %d\n", ret, error);
        //error
        duk_push_null(ctx);
    }
    return 1;
}

void select_task(void *ignore)
{
    jslog(DEBUG, "Starting select task...\n");

    while (true)
    {
        jslog(DEBUG, "Starting next select loop.\n");
        select_task_it();
    }
}

SSL_CTX *createSSLServerContext()
{
    const unsigned int cacert_pem_bytes = cacert_pem_end - cacert_pem_start;
    const unsigned int prvtkey_pem_bytes = prvtkey_pem_end - prvtkey_pem_start;

    jslog(INFO, "SSL server context create ......");
    SSL_CTX *ctx = SSL_CTX_new(TLS_server_method());
    if (!ctx)
    {
        abort();
    }
    jslog(INFO, "OK");

    jslog(INFO, "SSL server context set own certification......");
    int ret = SSL_CTX_use_certificate_ASN1(ctx, cacert_pem_bytes, cacert_pem_start);
    if (!ret)
    {
        jslog(INFO, "failed");
        abort();
    }
    jslog(INFO, "OK");

    jslog(INFO, "SSL server context set private key......");
    ret = SSL_CTX_use_PrivateKey_ASN1(0, ctx, prvtkey_pem_start, prvtkey_pem_bytes);
    if (!ret)
    {
        jslog(INFO, "failed");
        abort();
    }
    jslog(INFO, "OK");
    return ctx;
}

SSL_CTX *createSSLClientContext()
{
    jslog(INFO, "SSL client context create ......");
    SSL_CTX *ctx = SSL_CTX_new(TLSv1_2_client_method());

    SSL_CTX_set_verify(ctx, SSL_VERIFY_PEER, NULL);

    if (!ctx)
    {
        abort();
    }
    jslog(INFO, "OK");
    return ctx;
}

SSL *createSSL(SSL_CTX *ctx)
{
    jslog(INFO, "Create new SSL connection......");
    SSL *ssl = SSL_new(ctx);
    if (!ssl)
    {
        jslog(INFO, "failed");
        abort();
    }

    //ssl_set_client_transport_id((mbedtls_ssl_context *)ssl, (unsigned char*)"test", 4);

    jslog(INFO, "OK");
    return ssl;
}

static duk_ret_t el_createSSLServerContext(duk_context *ctx)
{
    duk_push_int(ctx, (duk_int_t)createSSLServerContext());
    return 1;
}

static duk_ret_t el_createSSLClientContext(duk_context *ctx)
{
    duk_push_int(ctx, (duk_int_t)createSSLClientContext());
    return 1;
}

static duk_ret_t el_createSSL(duk_context *ctx)
{
    SSL_CTX *sslCtx = (SSL_CTX *)duk_to_int(ctx, 0);

